/*------------------------------------------------------------------------------------------------------------------
Напишите программу, которая на вход принимает два числа A и B, и возводит число А в целую степень B с помощью рекурсии.
------------------------------------------------------------------------------------------------------------------*/

double Pow(int a, int b)
{
    if( b != 0 )
        if( b < 0) return Pow(a,b+1)*1/a;
        else return Pow(a,b-1)*a;
    else return 1;
}

Console.WriteLine(Pow(2,-3));