/*------------------------------------------------------------------------------------------------------------------
Напишите программу, которая будет принимать на вход число и возвращать сумму его цифр.
------------------------------------------------------------------------------------------------------------------*/

int SumOfDigits(int n)
{
    if(n > 0) return SumOfDigits( n / 10) + n % 10;
    else return 0;
}

Console.WriteLine(SumOfDigits(5734));